Revit 2027 API
SolidGeometryOptions Properties
The SolidGeometryOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SolidTag |  Optional solid tag for the Solid.
Top
See Also
Reference
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace